/*
 Localizable.strings
 Theseus
 
 Created by Jason Fieldman on 12/23/08.
 */


/* --------- Game Screen labels --------- */

"WaitLabel" = "等待";
"UndoLabel" = "撤销";
"MenuLabel" = "菜单";
"ResetLabel" = "复位";
"HintLabel" = "提示";
"OptionsLabel" = "设定";

"LevelLabel" = "关卡";
"DiamondLabel" = "宝石";
"MovesLabel" = "移动步数";
"BestLabel" = "最优";

/* --------- Main Menu labels --------- */

"TitleText" = "忒修斯和弥诺陶洛斯";
"LevelSelection" = "关卡选择";
"DesignedBy" = "设计者：";

"NotYet" = "未解决关卡";
"MovesLevelSel" = "步";
"SolvedIn" = "已解决";

/* ---------- Game Completion Menu --------- */

"CompMenuLabel" = "主菜单";
"CompNextLabel" = "下一关卡";
"CompReplayLabel" = "重玩";
"CompTitle" = "完成!";
"CompSubtitle" = "步";

/* ---------- Options ------------ */

"OptTitleSound" = "音效";
"OptTitleIdle" = "自动锁屏";
"OptTitleHint" = "屏蔽提示按钮";
"OptTitleHand" = "左右手习惯";

"OptDescSound" = "控制游戏内音效的开启和关闭。";
"OptDescIdle" = "打开这个，允许iPhone在游戏长时\n间未操作状态下入锁屏状态。";
"OptDescHint" = "打开这个，会让提示按钮进入\n不可用状态，防止不小心误操作:)";
"OptDescHand" = "打开这个，更适合右手操作\n关闭这个，更适合左手操作。";

/* ---------- Tutorial ---------------- */

"TutorialTitle" = "新手教学";

"Tutorial0" = "欢迎来到第一个关卡!  不用担心:这是一个教学用关卡，你不会失败的:)

先收起我们的顾虑。  来一起看看这段文字上面的关卡地图。  你是忒修斯：希腊的王子和时尚的蓝色圆圈。你被推进到弥诺陶洛斯（牛头怪）的迷宫：想要吞噬你的愤怒的红色圆圈。

要逃离一层迷宫，你必须到达这层迷宫出口的楼梯，期间弥诺陶洛斯没有抓到你（当他抓住你，你就成了盘中餐）。不要害怕做尝试：你可以通过按“撤销”按钮随时撤销移动，或者您可以通过按“复位”按钮重置整个关卡，也可以通过按“菜单”按钮返回主菜单。

此时，你可能已经注意到，牛头怪被困在水平中央行的一个隔间。你可以自由移动，而不必害怕捕获，来让我们尝试多重不同的移动方式吧：

1. 使用屏幕底部中央的方向键。点击一个方向，你将移动到相应方向的一个方格。

2. 用一个手指单击迷宫的任何地方。你将朝着点击方向最近的一个格子移动（如果这个格子可以到达）。

3. 在迷宫上滑动手指，你将朝着手指滑动的方向逐格移动。

另外支持两种额外的手势：你可以用两个手指点击一次来实现“等待”功能，可以通过向左滑动两个手指执行“撤销”。

现在，你可以使用任何你喜欢的控制方法，来到达右上角的楼梯位置。在路上，看看牛头怪如何移动。我们将在下一关卡详细讨论他。
";

"Tutorial1" = "现在是你的第一个挑战。你可能已经注意到，牛头怪现在被放出来了，如果你不小心它就会抓住你。

要生存，重要的是要了解弥诺陶洛斯（牛头怪）如何移动:

1. 牛头怪总是会等待你先移动（所以你有充足的时间来考虑好你的下一步走位）。

2. 对于你做的每一步移动动作，牛头怪都会做出两个移动动作来追赶你。

3. 对于牛头人每一回合的两个移动动作，他只会越来越靠近你。他永远不会进入比他当前位置离你更远的格子。如果移动不能让他更靠近你，他会保持原地休息。记住，牛头怪不能穿过墙壁。

4. 对于每回合牛头怪的两个动作，如果对他来说水平和垂直移动可以同样距离地接近你，他会优先选择水平移动。

在我们把这个知识变成实践之前，让我们先忘掉死亡。死亡在大多数游戏中是可怕的，但在这个游戏里不是。这个游戏的每个关卡是通过实验和模式匹配解决问题，害怕死亡将严重阻碍我们解决问题。所以让忒修斯向右走一步！当你这样做，牛头怪会得到他的两步移动动作。他会一步向右，一步向下，这两个动作都让他更接近你。现在只需要向左走一步就跑了！不幸的是，牛头怪可以再次采取两个步骤：一次下来，一次到左边，正好抓住和吃掉你:(但它是无痛的 - 只需按下撤消按钮两次，我们回到开始！

现在你已经经历了死亡，让我们找到解决这个问题的正确方法。向左走一步。牛头怪将在你离你更近两步：一次向左，一次向下。但看看当你向右走一步时会发生什么：在他目前的位置，牛头怪可以选择水平或垂直靠近你，他将总是选择水平（他在做决定时忽略了墙）。所以牛头怪已经走进一个陷阱！从这个位置，他只能向左移动。但是向左移动会让他离你更远（所以他选择原地休息）。你现在可以向右和向上继续移动安全退出关卡！";

"Tutorial2" = "你可能已经注意到，当你完成之前的关卡，你会得到这个关卡的奖牌。系统会根据你的表现奖励你这个关卡的金牌或银牌。用最少的动作完成一个关卡将获得金牌，否则你获得一枚银牌。从屏幕的顶部中心，你可以看到移动计数器。第一个数字是你已经进行的移动步数。第二个数字是允许获得金牌的最大移步数。如果想获取金牌，你可以多次尝试同一个关卡。

如果你想尝试自己逃出这个教程的迷宫，请直接进行操作，不用阅读接下来的教程内容。如果你死亡或犯了错误，可以随时撤销或重置。下面是这个关卡的解决方案。

从起始位置，向右走，直到你到达迷宫的最右边。牛头怪不能移动，因为向上或向下移动会使他进一步远离你。现在向上走一步，牛头怪现在可以向上移动（然后他会前进到右边）。向下三步，直到你到达迷宫的右下角。注意，牛头怪继续向右移动（而不是向下移动），因为他总是倾向于水平移动。

从你在迷宫右下角的位置，向左走一步。由于牛头怪喜欢水平运动，他的第一步也将向左移动。从那里，他的第二步将会向下（以更接近你）。但是这是什么？牛头怪又一次让自己陷入了陷阱！现在开始在你向左移动的时候，他不能再向上移动，因为那会让他和你离得更远。你现在可以安全地进入楼梯。
";

"Tutorial3" = "这是最后一个教学关卡，我们先来看几个高级概念然后我就放开你自己去解决后面的关卡。

首先，记住牛头怪总是得到的两个移动动作，然后你才可以逃离楼梯。虽然这次楼梯看起来真的很近，只需要向右走一步，但如果你试图为了生存做一个冲刺，牛头怪会在他的第二次移动后抓住你（试试吧！）

第二，这个游戏采用了很智能的计步器。这意味着，如果你返回到你已经进入过的位置，游戏会自动调整移动计步器，就好像使用了撤销命令。你可以从起始位置通过向下移动两次，然后向上移动两次来尝试。在向上的移动中，移动计数器减少，因为你已经在这些位置。

第三，如果你真的卡住了，你可以使用提示按钮允许系统帮你做一个步骤。如果没有办法从您当前的位置获胜，系统会为你撤销一次。要使用提示按钮，必须从选项菜单中关闭提示保护。请使用它作为最后的手段，因为它会毁了整个游戏的乐趣！

现在，为了逃离这个关卡，你必须使用“等待”命令。可以通过下方界面的等待按钮实现等待，也可以用两个手指同时点击屏幕上迷宫的位置。让我们看看等待有什么帮助：

先向下走两步，然后向左走一步。如果你立即回到右边的格子，你很快会被抓住。如果让牛头怪自己走进陷阱，不是很好吗？此时你尝试一下使用“等待”命令，等待允许你跳过你的移动环节而不进行位置的变动，而后牛头怪直接进行他回合的两次移动。引导牛头怪进入某些陷阱，这是非常有用的技巧 - 不要忘记！
";

/* --------- Info Text ----------- */

"InfoText" = "《Theseus and the Minotaur》
《忒修斯和弥诺陶洛斯》

前4个关卡
(关卡0~3)是教学关卡，
包含游戏的重要操作和说明，
一定要仔细阅读其中的技巧。

游戏初始默认有给20颗宝石币
每次点击提示按钮会消耗一颗宝石币
请珍惜使用提示的机会
宝石币使用完毕后可以重新购买

如果想玩更多同类
精巧而有趣的游戏
可以访问下面的网页：
http://mengyoutu.cn

忒修斯和弥诺陶洛斯
是罗伯特·阿伯特(RobertAbbott)
设计的一种逻辑迷宫。
在这个迷宫中，
玩家扮演了忒修斯，
雅典传说中的国王，
试图安全逃离一个内含凶猛怪兽的迷宫。
https://en.wikipedia.org/wiki/Theseus_and_the_Minotaur

";



